# Задача 1: Определите тип данных переменной price = 19.99.
price = 19.99
print(type(price))


# Задача 2: Напиши код, где:
# Переменная a = 10,
# Переменная b = 3,
# Выведи результат их сложения, вычитания, умножения и деления (каждое на новой строке).
a = 10
b = 3

print(a + b)
print(a - b)
print(a * b)
print(a/b)


# Задача 3: Напиши код, который создаёт три переменные:
# num — целое число,
# text — строку,
# is_true — булево значение.
# Выведи их типы с помощью функции type().
num =  123
text = "privet"
is_true = True
print(type(num))
print(type(text))
print(type(is_true))


# Задача 4: Даны переменные:
# x = 15
# y = 20
# Напиши код, который выводит результаты следующих сравнений (каждое с новой строки):
# x больше y?
# x не равно y?
# y меньше или равно x?
x = 15
y = 20

print(x > y)
print(x != y)
print(y <= x)


# Задача 5: Преобразуйте строку "15" в целое число.
num_str = "15"
num_int = int(num_str)
print(num_int)


# Задача 6: Дана переменная:
# x = 10
# Переопределите её значение на 20, а затем выведите новое значение на экран.
x = 10
x = 20
print(x)


#Задача 7: К какому типу данных (число, строка, булевый) относятся следующие значения?
#"Hello World", 42, True
print(type("Hello World"))
print(type(42))
print(type(True))